jmeter/benchmark_load.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
              testname="Benchmark LGPD - Carga Concorrente" enabled="true">
      <stringProp name="TestPlan.comments">
Plano de carga para o benchmark do middleware LGPD (Art. 18, VI).
Lê account_ids pré-inseridos de um CSV e dispara uma requisição DELETE
por thread, de forma concorrente.

Parâmetros (-J flags do jmeter -n):
  ACCOUNTS_CSV  caminho absoluto do CSV (header: account_id)
  NUM_THREADS   número de threads concorrentes        [padrão: 900]
  RAMP_UP       ramp-up em segundos                   [padrão: 30]
  RESULTS_JTL   caminho de saída do arquivo .jtl      [padrão: results/benchmark.jtl]
  HOST          host do middleware                    [padrão: localhost]
  PORT          porta do middleware                   [padrão: 8000]

Exemplo de uso:
  jmeter -n -t jmeter/benchmark_load.jmx \
    -JACCOUNTS_CSV=/abs/path/accounts_for_jmeter.csv \
    -JNUM_THREADS=900 -JRAMP_UP=30 \
    -JRESULTS_JTL=/abs/path/run1.jtl \
    -j /tmp/jmeter.log
      </stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables"
                   elementType="Arguments" guiclass="ArgumentsPanel"
                   testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ── HTTP Headers ─────────────────────────────────────────── -->
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                     testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <!-- ── CSV Data Set ──────────────────────────────────────────
           Lê account_ids reais pré-inseridos nos microsserviços.
           shareMode.all → todas as threads compartilham o mesmo leitor
           (fila FIFO), garantindo que cada thread pegue um ID único.
           recycle=false + stopThread=true → thread para se o CSV esgotar.
      ──────────────────────────────────────────────────────────── -->
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet"
                  testname="Account IDs" enabled="true">
        <stringProp name="filename">${__P(ACCOUNTS_CSV,tools/accounts_for_jmeter.csv)}</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="variableNames">account_id</stringProp>
        <stringProp name="delimiter">,</stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">false</boolProp>
        <boolProp name="stopThread">true</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
      </CSVDataSet>
      <hashTree/>

      <!-- ── Thread Group ──────────────────────────────────────────
           NUM_THREADS threads, cada uma dispara 1 requisição (loops=1).
           ramp-up de RAMP_UP segundos distribui a carga gradualmente.
      ──────────────────────────────────────────────────────────── -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="Carga Concorrente" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller"
                     elementType="LoopController" guiclass="LoopControlPanel"
                     testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(NUM_THREADS,900)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(RAMP_UP,30)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>

        <!-- HTTP POST — usa ${account_id} lido do CSV -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="POST /api/v1/privacy-requests/" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"account_id": "${account_id}", "operation": "DELETE"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${__P(HOST,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(PORT,8000)}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/privacy-requests/</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Assertion: middleware deve retornar HTTP 201 Created -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="HTTP 201 Created" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">201</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Esperado HTTP 201 — middleware não está respondendo?</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

      </hashTree>

      <!-- ── JTL Writer ────────────────────────────────────────────
           Salva métricas de latência HTTP (tempo de resposta do POST,
           não o tempo total do 2PC que é medido via banco de dados).
           Arquivo: RESULTS_JTL passado via -J flag.
      ──────────────────────────────────────────────────────────── -->
      <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector"
                       testname="JTL Writer" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">${__P(RESULTS_JTL,results/benchmark.jtl)}</stringProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>